In [5]:
#pip install pandas
#pip install geopy

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/fc/43/fd867e3347559845c8f993059d410c50a1e18709f1c4d4b3b47323a06a37/pandas-0.24.2-cp37-cp37m-macosx_10_6_intel.macosx_10_9_intel.macosx_10_9_x86_64.macosx_10_10_intel.macosx_10_10_x86_64.whl (15.9MB)
    100% |████████████████████████████████| 15.9MB 2.1MB/s ta 0:00:011
Collecting pytz>=2011k (from pandas)
  Downloading https://files.pythonhosted.org/packages/61/28/1d3920e4d1d50b19bc5d24398a7cd85cc7b9a75a490570d5a30c57622d34/pytz-2018.9-py2.py3-none-any.whl (510kB)
    100% |████████████████████████████████| 512kB 11.1MB/s ta 0:00:01
Requirement already satisfied: numpy>=1.12.0 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (1.16.2)
Requirement already satisfied: python-dateutil>=2.5.0 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-0.24.2 pytz-2018.9
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd
import geopy
from geopy import distance

In [4]:
art = pd.read_csv("art_gallery - art_gallery.csv")

In [5]:
art.head()

,Unnamed: 0,Theme,Sub Theme,Feature Name,Latitude,Longitude
0,0,Place Of Assembly,Art Gallery/Museum,Old Melbourne Gaol Crime & Justice Experience,-37.807764,144.965464
1,1,Place Of Assembly,Art Gallery/Museum,Polly Woodside,-37.824257,144.953478
2,2,Place Of Assembly,Art Gallery/Museum,Australian Centre for Contemporary Art,-37.826605,144.967253
3,3,Place Of Assembly,Art Gallery/Museum,Victorian Arts Centre,-37.821995,144.968837
4,4,Place Of Assembly,Art Gallery/Museum,The Ian Potter Centre: NGV Australia,-37.817483,144.969899

In [7]:
coords_1 = (art["Latitude"][0], art["Longitude"][0])
coords_2 = (art["Latitude"][1], art["Longitude"][1])
radius = 1
dist = geopy.distance.distance(coords_1, coords_2).km
if dist <= radius:
    print("In")
else: 
    print("Out")

Out

In [8]:
def within(df, target, radius, g):
    
    temp = []
    
    for x in range(len(target)):
        try:
            coords_1 = (df["Latitude"][g], df["Longitude"][g])
            coords_2 = (target["Latitude"][x], target["Longitude"][x])
            dist = geopy.distance.distance(coords_1, coords_2).km

            if dist <= radius:
                temp.append(target.iloc[x])
        except:
            pass
    return temp

## For Cafe & Restaurants

In [10]:
df1 = pd.read_csv("cafe_restaurant.csv")

In [159]:
filtered_df = pd.DataFrame(within(art, df1, 0.2, 18))
print("Number of Seats:" ,df1["Number of seats"].sum())
print("Number of cafe_restaurants:", len(df1))

Number of Seats: 9343
Number of cafe_restaurants: 126

## For Business

In [11]:
df2 = pd.read_csv("em_emp.csv")

In [213]:
df2 = df2[pd.notnull(df2['Total employment in block'])]
df2 = df2.rename(columns={'x coordinate': 'Longitude', 'y coordinate': 'Latitude'})
df2.head()

,Unnamed: 0,Block ID,Industry (ANZSIC4) description,Longitude,Latitude,Total employment in block
0,0,31,Health and Fitness Centres and Gymnasia Operation,144.956218,-37.818138,2058.0
1,1,31,Banking,144.955924,-37.817735,2058.0
2,2,31,Other Auxiliary Finance and Investment Services,144.955924,-37.817735,2058.0
3,3,31,Aluminium Smelting,144.955924,-37.817735,2058.0
4,4,31,Engineering Design and Engineering Consulting ...,144.955924,-37.817735,2058.0

In [22]:
for i in range(len(art)):
    df2 = pd.read_csv("em_emp.csv")
    df2 = df2[pd.notnull(df2['Total employment in block'])]
    df2 = df2.rename(columns={'x coordinate': 'Longitude', 'y coordinate': 'Latitude'})
    data = df2
    
    try:
        filtered = pd.DataFrame(within(art, data, 0.2, i))
        print("Number of employment:" ,filtered["Total employment in block"].mean())
        print("Block:", filtered["Block ID"].unique())
        print("Block num:", len(filtered["Block ID"].unique()))
    except:
        print("Error for:", i)

Number of employment: 998.7717948717949
Block: [ 267  252   87   96   83  258  260   97   62 1110  219  213  606  420
  519]
Block num: 15
Number of employment: 2500.4183070866143
Block: [ 21  94 804  48 787  73]
Block num: 6
Number of employment: 506.47966101694914
Block: [ 746  744  738  745  806  612  617 2385]
Block num: 8
Number of employment: 5309.390163934426
Block: [ 812  802  801 1101]
Block num: 4
Number of employment: 2027.9338262476895
Block: [ 17  16 214 270 804]
Block num: 5
Number of employment: 4131.0
Block: [804]
Block num: 1
Number of employment: 1977.4217877094973
Block: [1107  370 1108  740 1014  331  773  107  782  786  502]
Block num: 11
Number of employment: 5372.432989690722
Block: [ 42 570]
Block num: 2
Number of employment: 4131.0
Block: [804]
Block num: 1
Number of employment: 1494.0
Block: [57]
Block num: 1
Number of employment: 2916.3698175787727
Block: [ 21  94 787  73]
Block num: 4
Number of employment: 3261.303548910106
Block: [ 22  23  12 230  13 234   4   5  54]
Block num: 9
Number of employment: 3281.0022744503412
Block: [644  77  88  38  57]
Block num: 5
Number of employment: 1771.113074204947
Block: [ 206   53   63  646  809  560 2387]
Block num: 7
Number of employment: 3099.826536643026
Block: [  61   64   71 2547  559   82   86   87   62  649  651   77   72   84
 1104  265 1105  652  107]
Block num: 19
Number of employment: 1494.0
Block: [57]
Block num: 1
Number of employment: 5918.0
Block: [42]
Block num: 1
Number of employment: 1861.4934948407358
Block: [ 17  16 214  15 212 104 720 270 804]
Block num: 9
Number of employment: 2421.5776923076924
Block: [  66   74   87   96   77   18   58  429  752  801   67  263 2524   78
  203  215   53   52   57  507  327  504  781]
Block num: 23

## Pubs

In [23]:
df3 = pd.read_csv("pubs.csv")

In [24]:
df3.head()

,Unnamed: 0,Census year,Block ID,Property ID,Base property ID,Street address,CLUE small area,Trading name,Industry (ANZSIC4) code,Industry (ANZSIC4) description,Seating type,Number of seats,Latitude,Longitude
0,0,2015,242,104461,104461,191-197 Grattan Street,Carlton,Prince Alfred Hotel,4520,"Pubs, Taverns and Bars",Seats - Indoor,40,-37.800458,144.962209
1,1,2015,242,104461,104461,191-197 Grattan Street,Carlton,Prince Alfred Hotel,4520,"Pubs, Taverns and Bars",Seats - Outdoor,30,-37.800458,144.962209
2,2,2015,257,105516,105516,154-160 Leicester Street,Carlton,The Corkman Irish Pub,4520,"Pubs, Taverns and Bars",Seats - Indoor,150,-37.802432,144.960916
3,3,2015,257,105516,105516,154-160 Leicester Street,Carlton,The Corkman Irish Pub,4520,"Pubs, Taverns and Bars",Seats - Outdoor,10,-37.802432,144.960916
4,4,2015,266,106081,106081,27-31 Lygon Street,Carlton,John Curtin Hotel,4520,"Pubs, Taverns and Bars",Seats - Indoor,71,-37.806199,144.965699

In [47]:
seats = []
blocks = []

for i in range(len(art)):
    df3 = pd.read_csv("pubs.csv")
    #df3 = df3[pd.notnull(df3['Number of seats'])]
    #df3 = df3.rename(columns={'x coordinate': 'Longitude', 'y coordinate': 'Latitude'})
    data = df3
    
    try:
        filtered = pd.DataFrame(within(art, data, 0.5, i))
        n_seats = filtered['Number of seats'].sum()
        n_blocks = len(filtered["Block ID"].unique())
        
        seats.append(n_seats)
        blocks.append(n_blocks)
        
        print("Gallery ", i, " has:","Number of employment:" ,n_seats)
        print("Gallery ", i, " has:","Block num:", n_blocks)
        
    except:
        print("No Seats For:", i)

Gallery  0  has: Number of employment: 2442
Gallery  0  has: Block num: 14
Gallery  1  has: Number of employment: 843
Gallery  1  has: Block num: 3
No Seats For: 2
Gallery  3  has: Number of employment: 1083
Gallery  3  has: Block num: 4
Gallery  4  has: Number of employment: 2654
Gallery  4  has: Block num: 11
Gallery  5  has: Number of employment: 50
Gallery  5  has: Block num: 1
Gallery  6  has: Number of employment: 1225
Gallery  6  has: Block num: 4
Gallery  7  has: Number of employment: 173
Gallery  7  has: Block num: 3
Gallery  8  has: Number of employment: 50
Gallery  8  has: Block num: 1
No Seats For: 9
Gallery  10  has: Number of employment: 1093
Gallery  10  has: Block num: 4
Gallery  11  has: Number of employment: 2052
Gallery  11  has: Block num: 11
Gallery  12  has: Number of employment: 1065
Gallery  12  has: Block num: 3
Gallery  13  has: Number of employment: 668
Gallery  13  has: Block num: 5
Gallery  14  has: Number of employment: 1774
Gallery  14  has: Block num: 7
No Seats For: 15
Gallery  16  has: Number of employment: 173
Gallery  16  has: Block num: 3
Gallery  17  has: Number of employment: 2834
Gallery  17  has: Block num: 12
Gallery  18  has: Number of employment: 4415
Gallery  18  has: Block num: 15